<template>
  <div>
    <AppBar></AppBar>
    <v-main class="mt-8 mb-5 mx-5">
      <Card :cardColor="getCardColor" title text :image="false">
        <v-row slot="cardTitle" class="d-flex justify-space-between pb-5 px-5">
          <div
            :style="{ color: $vuetify.theme.currentTheme.primary }"
            class="bold"
          >
            افزودن سامانه به لیست برنامه‌های نصب شده تلفن همراه شما
          </div>
        </v-row>
        <v-row align="center" justify="center" slot="cardText" no-gutters>
          <p>
            می‌توانید این سامانه را به صورت برنامه موبایلی به صفحه برنامه‌های
            خود اضافه نمایید تا برای استفاده‌های بعدی، در دسترس باشد و نیازی به
            جستجوی نام وب‌سایت نباشد. برای افزودن وب‌سایت به لیست برنامه‌های نصب
            شده در تلفن همراه خود، می‌توانید از طریق زیر عمل نمایید:
          </p>
          <v-col cols="12" sm="12" md="6" lg="6">
            <v-img src="@/assets/images/Guide/installApp.png"></v-img>
          </v-col>
        </v-row>
      </Card>

      <Card :cardColor="getCardColor" title text :image="false" class="mt-5">
        <v-row slot="cardTitle" class="d-flex justify-space-between pb-5 px-5">
          <div
            :style="{ color: $vuetify.theme.currentTheme.primary }"
            class="bold"
          >
            ایجاد حساب کاربری
          </div>
        </v-row>
        <v-row align="center" justify="center" slot="cardText" no-gutters>
          <p>
            در بالای صفحه، روی عبارت «ثبت نام» کلیک کنید. در صفحه باز شده، شماره
            تلفن همراه خود را وارد نمایید و دکمه دریافت کد را کلیک کنید. به
            شماره تلفن همراه شما، پیامکی ارسال می‌گردد. آن کد را در قسمت مربوطه
            وارد نمایید و در صورتی که کد به درستی وارد شده باشد، وارد صفحه ثبت
            نام خواهید شد. در صفحه ثبت نام، اطلاعات مورد نیاز را تکمیل نمایید.

            <b
              >اگر توسط خیریه مشخصی با سامانه آشنا شده اید، می‌توانید نام آن
              خیریه را انتخاب نمایید. در غیر این صورت، گزینه «سایر» را انتخاب
              کنید.</b
            >
            پس از انتخاب استان محل زندگی خود، می‎توانید روی نقشه، آدرس خود را
            انتخاب نمایید (این مورد برای ثبت مشارکت در بخش سفره و هدیه مهربانی
            ضروری است تا نمایندگان خیریه بتوانند اقلام را از شما در محل خودتان
            تحویل بگیرند).
            <b
              >برای ثبت آدرس از روی نقشه، کافی است روی نقطه مدنظر خود کلیک
              کنید.</b
            >
            پس از آن رمز عبور مشخصی را برای خود در نظر گرفته و جهت تایید درستی،
            دو بار آن را وارد نمایید. پس از آن، با کلیک بر گزینه ثبت نام، حساب
            کاربری شما ساخته شده واز این پس می‌توانید در بخش‌های مختلف سامانه،
            کمک‍‌های خیرخواهانه خود را ثبت نمایید.
            <br />
            <b>
              پس از ثبت نام، وارد سامانه خواهید شد. شماره تلفن همراه شما به
              عنوان نام کاربری، و رمز عبوری که مشخص کرده اید، از این پس برای
              ورود شما به سامانه نیاز خواهد بود.
            </b>
          </p>
          <v-col cols="12" sm="12" md="6" lg="6">
            <v-img src="@/assets/images/Guide/register1.png"></v-img>
            <v-img src="@/assets/images/Guide/register2.png"></v-img>
          </v-col>
        </v-row>
      </Card>

      <Card :cardColor="getCardColor" title text :image="false" class="mt-5">
        <v-row slot="cardTitle" class="d-flex justify-space-between pb-5 px-5">
          <div
            :style="{ color: $vuetify.theme.currentTheme.primary }"
            class="bold"
          >
            بخش‌های سامانه
          </div>
        </v-row>
        <v-row align="center" justify="center" slot="cardText" no-gutters>
          <p>
            در بخش‌های مختلف سامانه می‌توانید مشارکت‌های خود را ثبت نمایید. 4
            بخش در دسترس است: <br />در بخش <b>سفره و هدیه مهربانی</b>، شما تنها
            امکان مشارکت غذا و اجناس در خیریه‌هایی را خواهید داشت که آدرس شما را
            تحت پوشش خود داشته باشند. ممکن است خیریه‌ای در محدوده شما فعال باشد
            اما در محدوده دیگری از شهر، فعالیت نداشته باشد. امکان مشارکت در بخش
            سفره و هدیه مهربانی، منوط به این است خیریه‌ای، مکان شما را تحت پوشش
            داشته باشد یا خیر. یا به عبارتی دیگر، مکان شما در
            <b>منطقه تحت پوشش خیریه</b> قرار دارد یا خیر. در صورتی که خیریه،
            خارج از محدوده شما باشد، به صورت خاکستری نمایش داده می‌شود ولی در
            غیر این صورت، امکان ثبت مشارکت برای شما فعال خواهد بود. <br />برای
            بخش <b>پویش و اخبار مهربانی</b>، محدودیت مکانی وجود ندارد و شما
            می‌توانید کمک‌های نقدی خود را به حساب هر خیریه‌ای در هر نقطه‌ای از
            کشور واریز نمایید یا اخبار مربوط به کدام از خیریه‌ها در هر مکانی را
            مشاهده کنید. <br /><br /><b>جزئیات سفره مهربانی:</b><br />پس از وارد
            شدن به بخش سفره مهربانی، شما می‌توانید لیستی از خیریه‌هایی که سفره
            مهربانی ثبت کرده اند را مشاهده کنید. با کلیک روی نام هر خیریه،
            می‌توانید اطلاعات بیشتری درباره خیریه کسب نمایید یا با آن در تماس
            باشید. پس از کلیک بر «مشاهده سفره‌های مهربانی»، می‌توانید لیستی از
            سفره‌های آن خیریه را ببینید. هر سفره، زمان مشخصی جهت جمع‌آوری دارد و
            تعداد مشخصی غذا که مورد نیاز است، به شما نشان داده می‌شود. باید توجه
            کنید اگر تمایل دارید غذای خود را برای اطعام به نیازمندان ثبت نمایید،
            باید در تاریخ و ساعت مشخص شده برای آن سفره، آن آماده و به نماینده
            تحویل دهید. با مشاهده تاریخ و زمان هر سفره، هر کدام که برای شما
            مناسب‌تر است و آمادگی خواهید داشت را انتخاب کنید، نوع غذا و تعداد
            غذای خود را مشخص نمایید و آن را ثبت نمایید. پس از آن، در زمان مشخص
            شده غذای خود را آماده داشته باشید تا سفیر هر خیریه به مکان شما
            مراجعه کند و آن را تحویل بگیرد. در صورتی که نیاز به هماهنگی بیشتری
            وجود داشت، می‌توانید از طریق اطلاعات تماس سفیر خیریه که پس از ثبت
            مشارکت نمایش داده می‌شود، در ارتباط باشید.<br /><br /><b
              >جزئیات پویش مهربانی:</b
            ><br />برای بخش پویش مهربانی، نیاز است در نسخه فعلی «لبخند مهربانی»،
            ابتدا نیازهای مطرح شده توسط هر خیریه را مشاهده نمایید و پس از آن،
            مبلغی را با استفاده از همراه بانک خود یا روشی دیگر، به شماره کارت
            خیریه که در بالای صفحه نمایش داده شده است واریز نمایید و پس از آن به
            سامانه برگشته و مشخص می‌کنید که مبلغی را که به شماره کارت خیریه
            واریز کرده اید، به هدف تامین هزینه چه نیازی بوده است.
          </p>
        </v-row>
      </Card>
    </v-main>
  </div>
</template>

<script>
import AppBar from "@/components/basics/AppBar.vue";
import Card from "@/components/basics/Card.vue";

export default {
  name: "Guide",

  components: {
    AppBar,
    Card,
  },

  computed: {
    getCardColor() {
      return this.$hexToRgba(this.$vuetify.theme.currentTheme.secondary, 0.15);
    },
  },
};
</script>
